## Pandas Basic Assignment

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd
s1 = pd.Series([4,8,15,16,23,42])
print(s1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [2]:
data = [1,2,3,4,5,6,7,8,9,10]
print(pd.Series(data))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
    Name Alice Bob Claire
    Age 25 30 27
    Gender Female Male Female

In [3]:
d1 = {
    "Name" : ["Alice", "Bob", "Claire"],
    "Age" : [25, 30, 27],
    "Gender" : ["Female", "Male", "Female"]
}

df = pd.DataFrame(d1)

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A. Pandas Dataframe: 
    
    A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.
    
B. Difference between Pandas Series and Dataframe:
    
    a. Pandas Series is One-Dimensional whereas, pandas dataframe is two-dimensional.
    b. Homogenous series element is of same datatype whereas, dataframe elements is of heterogenous different datatypes.
    c. Size-immutable once created the size of the series object cannot be changed whereas, size-mutable elements can be dropped or added in an existing dataframe.
    
C. Example of both given below:

In [5]:
### Example of pandas series:
print(s1)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
### Example of pandas dataframe:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

A. Common Functions:
    
    value_counts
    groupby
    loc and iloc
    unique and nunique
    Cut and qcut
    
B. Example of one given below:

In [7]:
df.groupby('Gender').mean()

/tmp/ipykernel_70/3774296011.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Gender').mean()

         Age
Gender
Female  26.0
Male    30.0

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Dataframe is mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [11]:

# Create pandas Series
courses = pd.Series(["DS","Java","Webdev"])

fees = pd.Series([22000,25000,23000])

discount  = pd.Series([1000,2300,1000])

# Combine two series.
df=pd.concat([courses,fees],axis=1)

# It also supports to combine multiple series.
df=pd.concat([courses,fees,discount],axis=1)

df

        0      1     2
0      DS  22000  1000
1    Java  25000  2300
2  Webdev  23000  1000